1.Importing libraries
2.Importing dataframes
3.Checking dimensions of the imported dataframes
4.Merging the two dataframes
5.Exporting Dataframe as pkl

Importing libraries

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [4]:
# Creating a path
path = r'C:\Users\henry\OneDrive\042025Instacart Basket Analysis'

Importing dataframes

In [7]:
# Import dataset orders_products_combined.pkl
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 DATA', 'Prepared Data', 'orders_products_combined.pkl'))

# Import dataset products_cleaned_1.csv
df_prods = pd.read_csv(os.path.join(path, '02 DATA', 'Prepared Data', 'products_cleaned_1.csv'), index_col = False)

Checking dimensions of the imported dataframes

In [10]:
# Check the output
df_ords_prods_combined.head()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [22]:
# Drop Unnamed column
df_ords_prods_combined= df_ords_prods_combined.drop(['Unnamed: 0'], axis=1)

In [24]:
# Checking the output again without unnamed column
df_ords_prods_combined.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [12]:
df_ords_prods_combined.shape

(32434489, 11)

In [14]:
# Check the output
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
# Drop Unnamed column
df_prods = df_prods.drop(['Unnamed: 0'], axis=1)

In [20]:
# Checking output after droping unnamed column
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [28]:
# Check the shape
df_prods.shape

(49670, 5)

Merging Dataframe

To ensure cleaner presentation and avoid carrying over unnecessary data, the 'merge' column created during a previous merge should be removed before performing a new merge. The df_ords_prods_combined dataframe can then be merged with the df_prods dataframe using an inner join on the shared 'product_id' column. This approach retains only rows with matching product IDs in both dataframes, resulting in a clean and relevant combined dataset for further analysis.

In [32]:
# drop the column '_merge' from the previous merge
df_ords_prods_combined = df_ords_prods_combined.drop(['_merge'], axis=1)

In [34]:
# Check output
df_ords_prods_combined.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [36]:
# Check output
df_ords_prods_combined.shape

(32434489, 9)

In [38]:
# Merge the updated dataframes
df_ords_prods_merge = df_prods.merge(df_ords_prods_combined, on = 'product_id', indicator = True)

In [39]:
# Check the output
df_ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,3.0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,20.0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,6.0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,NaN,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,9.0,11,1,both

In [42]:
df_ords_prods_merge.shape

(32399732, 14)

 Confirm the results of the merge using the merge flag

In [44]:
df_ords_prods_merge['_merge'].value_counts()

_merge
both          32399732
left_only            0
right_only           0
Name: count, dtype: int64

In [46]:
# Export data to pkl
df_ords_prods_merge.to_pickle(os.path.join(path, '02 DATA','Prepared Data', 'ords_prods_merge.pkl'))